app/Models/Categoria.php

SELECT *
FROM `categoria`
---
    public function get_Items()
    {
        $data=$this->findAll();

SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '3'
---
    public function get_Item($id)
    {
        $data=$this->find($id);