app/Models/Compraprodutos.php

SELECT *
FROM `compraprodutos`
WHERE `notafiscal` = '5'
---
    public function get_produtosByCompra($compra)
    {
        $data=$this->where('notafiscal', $compra)->findAll();