app/Models/Console.php

    public function get_Items()
    {
        $data=$this->findAll();
---
SELECT *
FROM `console`

    public function get_Item($id)
    {
        $data=$this->find($id);
---
SELECT *
FROM `console`
WHERE `console`.`id` = '7'