app/Models/Items.php

SELECT *
FROM `items`
---
    public function get_Items()
    {
        $data=$this->findAll();

SELECT *
FROM `items`
WHERE `items`.`id` = '1'
---
    public function get_Item($id)
    {
        $data=$this->find($id);