app/Models/Notafiscal.php

SELECT *
FROM `notafiscal`
---
    public function get_NotasFiscais()
    {
        $data=$this->findAll();